Revit 2027 API
RebarInSystem.IsRebarInSection Method
 Identifies if this RebarInSystem is cut by the view plane of the given view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsRebarInSection(
	View dBView
)
Public Function IsRebarInSection (
	dBView As View
) As Boolean
public:
bool IsRebarInSection(
	View^ dBView
)
member IsRebarInSection :
        dBView : View -> bool
Parameters
dBView View
 The view.
Return Value
Boolean
 True if this RebarInSystem is cut by the view plane, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This method applies only for elevations and sections. For any other view types will return false.
See Also
Reference
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace